import { createStyles, makeStyles, Theme } from "@material-ui/core/styles";
import Container from "@material-ui/core/Container";

const useStyles = makeStyles((theme: Theme) =>
  createStyles({
    container: {
      marginTop: theme.spacing(2),
    },
    table: {
      minWidth: 650,
    },
    tableSpace: {
      marginTop: 20,
    },
  })
);

function Home() {
  const classes = useStyles();

  return (
    <div>
      <Container className={classes.container} maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบจองคิวโรงพยาบาลมหาวิทยาลัยเทคโนโลยีสุรนารี</h1>
        <h3>Requirements</h3>
        <p>
          ระบบนัดหมายเป็นระบบที่ทำมาเพื่อให้ผู้ป่วยสามารถนัดหมายวันที่เข้ามารักษากับแพทย์ล่วงหน้า 
          เพื่อเป็นการย่นระยะเวลาในการรอแพทย์ เมื่อเทียบกับการไปพบแพทย์โดยไม่ทำการนัดหมายล่วงหน้า 
          ผู้ป่วยจะสามารถ login เข้าสู่ระบบเพื่อดูข้อมูลประวัติและตารางเวลางานของแพทย์แต่ละท่านได้ 
          นอกจากนี้ผู้ป่วยจะต้องทำการกรอกประวัติส่วนตัวและเลือกวันที่จะเข้ารักษา
	        ระบบการจองคิวของโรงพยาบาล เป็นระบบที่ผู้ใช้งานต้อง login เข้าสู่ระบบการจองคิวของโรงพยาบาล 
          จากนั้นผู้ใช้งานระบบจะต้องทำการระบุอาการป่วยที่จะเข้ารับการวินิจฉัย หรือเข้ารับการรักษาจากหมอ 
          นอกจากนี้ผู้ใช้งานระบบยังสามารถระบุได้ว่าต้องการเข้าพบแพทย์เฉพาะทางด้านใด 
          จากนั้นทำการเลือกวันที่และเวลาที่ต้องการจองคิว เสร็จแล้วทำการบันทึกข้อมูลเพื่อจองคิว 
          ระบบจะทำการบันทึกข้อมูลการจองคิวและส่งข้อมูลไปยังโรงพยาบาลเพื่อให้เจ้าหน้าที่ตรวจสอบและทำการจองคิวให้

        </p>
      </Container>
    </div>
  );
}
export default Home;